/**
 * @file gl08_gpio.c
 * @brief GPIO模块实现
 *
 * @date 2026-02-07
 */
#include "STC8H.h"
#include "gl08_gpio.h"

// GPIO 初始化
void gpio_init(void) {
    // Set P1 port mode
    P1M1 |= (1 << 0);  // 10，模式2，高阻输入，P1.0端口配置，用于捕获第一路PWM1的输入
    P1M0 &= ~(1 << 0);

    P1M1 |= (1 << 1);  // 10，模式2，高阻输入，P1.1端口配置，用于捕获第一路PWM2的输入
    P1M0 &= ~(1 << 1);

    P1M1 |= (1 << 2);  // 10，模式2，高阻输入，P1.2端口配置，LED（LED初始化在led_init中）
    P1M0 &= ~(1 << 2);

    // 10，模式2，高阻输入，P1.4端口配置，用于捕获第一路PWM2的输入，只有该端口能进行双通道捕获
    P1M1 |= (1 << 4);
    P1M0 &= ~(1 << 4);

    // Set P3 port mode
    P3M1 |= (1 << 2);  // 10，模式2，高阻输入，P3.2端口配置，ADC采样，采集功率档位
    P3M0 &= ~(1 << 2);

    P3M1 &= ~(1 << 3);  // 01，模式1，推挽输出，P3.3端口配置，第一路PWM输出
    P3M0 |= (1 << 3);

    P3M1 &= ~(1 << 4);  // 01，模式1，推挽输出，P3.4端口配置，第二路PWM输出
    P3M0 |= (1 << 4);

    P3M1 |= (1 << 5);  // 10，模式2，高阻输入，P3.5端口配置，ADC采样，采集第一路波段档位
    P3M0 &= ~(1 << 5);

    P3M1 |= (1 << 6);  // 10，模式2，高阻输入，P3.6端口配置，ADC采样，采集第二路波段档位
    P3M0 &= ~(1 << 6);

    // 初始化完后将PWM输出引脚拉低
    PWM_OUT1_CLR();
    PWM_OUT2_CLR();
}
